### Forest Mainnet Infrastructure  Plan: success

<details><summary>Show Plan</summary>

```
module.mainnet.digitalocean_volume.forest_volume[0]: Refreshing state... [id=5137f810-dcfc-11ed-bcda-0a58ac14d195]
module.mainnet.data.digitalocean_project.forest_project: Reading...
module.mainnet.data.digitalocean_ssh_keys.keys: Reading...
module.mainnet.data.digitalocean_ssh_keys.keys: Read complete after 1s [id=ssh_keys/4127341138294685345]
module.mainnet.digitalocean_droplet.forest_observability: Refreshing state... [id=351088975]
module.mainnet.digitalocean_droplet.forest: Refreshing state... [id=351088974]
module.mainnet.digitalocean_volume_attachment.forest_volume[0]: Refreshing state... [id=351088974-5137f810-dcfc-11ed-bcda-0a58ac14d195-20230417084631402100000001]
module.mainnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=bae71eb2-757b-4dfc-ac4e-4db0b6e75120]
module.mainnet.local_file.inventory: Refreshing state... [id=eb285a5011bcf88da2d202db4a03e3cf1732206c]
module.mainnet.digitalocean_firewall.forest_observability_firewall: Refreshing state... [id=6909ecfb-47b7-41a0-97da-382ca52a189c]
module.mainnet.data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.mainnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.mainnet.local_file.inventory will be created
  + resource "local_file" "inventory" {
      + content              = <<-EOT
            [forest]
            64.226.107.21
            [observability]
            64.226.118.187
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../ansible/hosts_mainnet"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>